logs/fio-diskseq/slurm/000/log000.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;93108;363;90095;0;0;0.000000;0.000000;67;471810;2742.028601;6943.021114;1.000000%=96;5.000000%=96;10.000000%=97;20.000000%=98;30.000000%=98;40.000000%=101;50.000000%=111;60.000000%=142;70.000000%=179;80.000000%=6979;90.000000%=10813;95.000000%=14614;99.000000%=18743;99.500000%=21626;99.900000%=35913;99.950000%=49545;99.990000%=320864;0%=0;0%=0;0%=0;69;471813;2745.717301;6942.973495;512;531456;100.000000%;93206.755556;87749.396897;0.162053%;4.739494%;7811;3;9;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;35.00%;41.71%;0.35%;0.01%;0.00%;0.00%;0.00%;10.66%;11.60%;0.63%;0.01%;0.03%;0.01%;0.00%;0.00%;0.00%;0.00%;dm-0;227;1465;0;0;10497;108733;119230;59.51%;slaves;278;32582;0;44;14679;319716;336836;98.85%;sda;278;32582;0;44;14679;319716;336836;98.85%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=10855: Fri Nov 17 19:41:49 2023
  write: IOPS=363, BW=90.9MiB/s (95.3MB/s)(8192MiB/90095msec); 0 zone resets
    clat (usec): min=67, max=471810, avg=2742.03, stdev=6943.02
     lat (usec): min=69, max=471813, avg=2745.72, stdev=6942.97
    clat percentiles (usec):
     |  1.00th=[    97],  5.00th=[    97], 10.00th=[    98], 20.00th=[    99],
     | 30.00th=[    99], 40.00th=[   102], 50.00th=[   112], 60.00th=[   143],
     | 70.00th=[   180], 80.00th=[  6980], 90.00th=[ 10814], 95.00th=[ 14615],
     | 99.00th=[ 18744], 99.50th=[ 21627], 99.90th=[ 35914], 99.95th=[ 49546],
     | 99.99th=[320865]
   bw (  KiB/s): min=  512, max=531456, per=100.00%, avg=93206.76, stdev=87749.40, samples=180
   iops        : min=    2, max= 2076, avg=364.09, stdev=342.77, samples=180
  lat (usec)   : 100=35.00%, 250=41.71%, 500=0.35%, 750=0.01%
  lat (msec)   : 10=10.66%, 20=11.60%, 50=0.63%, 100=0.01%, 250=0.03%
  lat (msec)   : 500=0.01%
  cpu          : usr=0.16%, sys=4.74%, ctx=7811, majf=3, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=90.9MiB/s (95.3MB/s), 90.9MiB/s-90.9MiB/s (95.3MB/s-95.3MB/s), io=8192MiB (8590MB), run=90095-90095msec

Disk stats (read/write):
    dm-0: ios=227/1465, merge=0/0, ticks=10497/108733, in_queue=119230, util=59.51%, aggrios=278/32582, aggrmerge=0/44, aggrticks=14679/319716, aggrin_queue=336836, aggrutil=98.85%
  sda: ios=278/32582, merge=0/44, ticks=14679/319716, in_queue=336836, util=98.85%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-read;0;0;8388608;499292;1950;16801;0;0;0.000000;0.000000;25;138873;512.123874;2668.235194;1.000000%=27;5.000000%=33;10.000000%=35;20.000000%=36;30.000000%=37;40.000000%=37;50.000000%=38;60.000000%=39;70.000000%=41;80.000000%=45;90.000000%=60;95.000000%=74;99.000000%=15138;99.500000%=15269;99.900000%=15532;99.950000%=15794;99.990000%=16318;0%=0;0%=0;0%=0;25;138873;512.189487;2668.232801;425984;544256;99.823095%;498408.727273;24208.279275;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.214286%;14.386905%;1850;0;144;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;83.68%;11.65%;0.01%;0.01%;0.00%;0.01%;0.88%;0.67%;0.46%;2.64%;0.00%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1582;0;0;0;43756;0;43756;91.46%;slaves;32939;0;46;0;737968;0;737968;99.41%;sda;32939;0;46;0;737968;0;737968;99.41%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=10932: Fri Nov 17 19:43:55 2023
  read: IOPS=1950, BW=488MiB/s (511MB/s)(8192MiB/16801msec)
    clat (usec): min=25, max=138873, avg=512.12, stdev=2668.24
     lat (usec): min=25, max=138873, avg=512.19, stdev=2668.23
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   34], 10.00th=[   36], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   38], 50.00th=[   39], 60.00th=[   40],
     | 70.00th=[   42], 80.00th=[   46], 90.00th=[   61], 95.00th=[   75],
     | 99.00th=[15139], 99.50th=[15270], 99.90th=[15533], 99.95th=[15795],
     | 99.99th=[16319]
   bw (  KiB/s): min=425984, max=544256, per=99.82%, avg=498408.73, stdev=24208.28, samples=33
   iops        : min= 1664, max= 2126, avg=1946.91, stdev=94.56, samples=33
  lat (usec)   : 50=83.68%, 100=11.65%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.88%, 4=0.67%, 10=0.46%, 20=2.64%, 250=0.01%
  cpu          : usr=0.21%, sys=14.39%, ctx=1850, majf=0, minf=144
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=488MiB/s (511MB/s), 488MiB/s-488MiB/s (511MB/s-511MB/s), io=8192MiB (8590MB), run=16801-16801msec

Disk stats (read/write):
    dm-0: ios=1582/0, merge=0/0, ticks=43756/0, in_queue=43756, util=91.46%, aggrios=32939/0, aggrmerge=46/0, aggrticks=737968/0, aggrin_queue=737968, aggrutil=99.41%
  sda: ios=32939/0, merge=46/0, ticks=737968/0, in_queue=737968, util=99.41%