logs/fio-diskseq/slurm/000/log003.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;80743;315;103892;0;0;0.000000;0.000000;74;253976;3165.735561;7751.169390;1.000000%=96;5.000000%=97;10.000000%=98;20.000000%=110;30.000000%=113;40.000000%=114;50.000000%=119;60.000000%=140;70.000000%=203;80.000000%=7045;90.000000%=10813;95.000000%=15925;99.000000%=25559;99.500000%=28442;99.900000%=117964;99.950000%=128450;99.990000%=238026;0%=0;0%=0;0%=0;77;253982;3169.310706;7751.286718;1536;561664;98.991725%;79928.888889;91289.161628;0.154008%;4.394028%;10966;0;217;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;12.05%;62.08%;0.31%;0.01%;0.00%;0.26%;0.09%;12.78%;10.75%;1.49%;0.08%;0.11%;0.01%;0.00%;0.00%;0.00%;0.00%;dm-0;1571;1534;0;0;25756;126019;151775;66.56%;slaves;2141;32625;4;43;32766;358539;393365;98.01%;sda;2141;32625;4;43;32766;358539;393365;98.01%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=11398: Fri Nov 17 19:49:53 2023
  write: IOPS=315, BW=78.9MiB/s (82.7MB/s)(8192MiB/103892msec); 0 zone resets
    clat (usec): min=74, max=253976, avg=3165.74, stdev=7751.17
     lat (usec): min=77, max=253982, avg=3169.31, stdev=7751.29
    clat percentiles (usec):
     |  1.00th=[    97],  5.00th=[    98], 10.00th=[    99], 20.00th=[   111],
     | 30.00th=[   114], 40.00th=[   115], 50.00th=[   120], 60.00th=[   141],
     | 70.00th=[   204], 80.00th=[  7046], 90.00th=[ 10814], 95.00th=[ 15926],
     | 99.00th=[ 25560], 99.50th=[ 28443], 99.90th=[117965], 99.95th=[128451],
     | 99.99th=[238027]
   bw (  KiB/s): min= 1536, max=561664, per=98.99%, avg=79928.89, stdev=91289.16, samples=207
   iops        : min=    6, max= 2194, avg=312.22, stdev=356.60, samples=207
  lat (usec)   : 100=12.05%, 250=62.08%, 500=0.31%, 750=0.01%
  lat (msec)   : 2=0.26%, 4=0.09%, 10=12.78%, 20=10.75%, 50=1.49%
  lat (msec)   : 100=0.08%, 250=0.11%, 500=0.01%
  cpu          : usr=0.15%, sys=4.39%, ctx=10966, majf=0, minf=217
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=78.9MiB/s (82.7MB/s), 78.9MiB/s-78.9MiB/s (82.7MB/s-82.7MB/s), io=8192MiB (8590MB), run=103892-103892msec

Disk stats (read/write):
    dm-0: ios=1571/1534, merge=0/0, ticks=25756/126019, in_queue=151775, util=66.56%, aggrios=2141/32625, aggrmerge=4/43, aggrticks=32766/358539, aggrin_queue=393365, aggrutil=98.01%
  sda: ios=2141/32625, merge=4/43, ticks=32766/358539, in_queue=393365, util=98.01%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;419955;1640;19975;0;0;0.000000;0.000000;23;140092;608.925993;3920.820990;1.000000%=26;5.000000%=28;10.000000%=30;20.000000%=33;30.000000%=36;40.000000%=39;50.000000%=43;60.000000%=44;70.000000%=45;80.000000%=48;90.000000%=62;95.000000%=1368;99.000000%=15269;99.500000%=15400;99.900000%=52166;99.950000%=84410;99.990000%=124256;0%=0;0%=0;0%=0;23;140092;608.994982;3920.818513;151552;524288;100.000000%;420050.051282;133059.858438;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.175228%;13.182137%;2200;0;210;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;81.22%;13.67%;0.04%;0.02%;0.01%;0.02%;1.05%;0.85%;0.57%;2.40%;0.04%;0.09%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1807;17;0;0;58973;5478;64451;91.49%;slaves;33074;302;35;1;924539;11225;935827;98.61%;sda;33074;302;35;1;924539;11225;935827;98.61%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=11458: Fri Nov 17 19:50:14 2023
  read: IOPS=1640, BW=410MiB/s (430MB/s)(8192MiB/19975msec)
    clat (usec): min=23, max=140092, avg=608.93, stdev=3920.82
     lat (usec): min=23, max=140092, avg=608.99, stdev=3920.82
    clat percentiles (usec):
     |  1.00th=[    27],  5.00th=[    29], 10.00th=[    31], 20.00th=[    34],
     | 30.00th=[    37], 40.00th=[    40], 50.00th=[    44], 60.00th=[    45],
     | 70.00th=[    46], 80.00th=[    49], 90.00th=[    63], 95.00th=[  1369],
     | 99.00th=[ 15270], 99.50th=[ 15401], 99.90th=[ 52167], 99.95th=[ 84411],
     | 99.99th=[124257]
   bw (  KiB/s): min=151552, max=524288, per=100.00%, avg=420050.05, stdev=133059.86, samples=39
   iops        : min=  592, max= 2048, avg=1640.82, stdev=519.77, samples=39
  lat (usec)   : 50=81.22%, 100=13.67%, 250=0.04%, 500=0.02%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=1.05%, 4=0.85%, 10=0.57%, 20=2.40%, 50=0.04%
  lat (msec)   : 100=0.09%, 250=0.02%
  cpu          : usr=0.18%, sys=13.18%, ctx=2200, majf=0, minf=210
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=410MiB/s (430MB/s), 410MiB/s-410MiB/s (430MB/s-430MB/s), io=8192MiB (8590MB), run=19975-19975msec

Disk stats (read/write):
    dm-0: ios=1807/17, merge=0/0, ticks=58973/5478, in_queue=64451, util=91.49%, aggrios=33074/302, aggrmerge=35/1, aggrticks=924539/11225, aggrin_queue=935827, aggrutil=98.61%
  sda: ios=33074/302, merge=35/1, ticks=924539/11225, in_queue=935827, util=98.61%